constant/innerWall/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/innerWall/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    hotGasWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2885;
    }
    solidInlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15;
        startFace       2985;
    }
    solidOutlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15;
        startFace       3000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3000;
        startFace       3015;
    }
    innerWall_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          100;
        startFace       6015;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_innerWall;
    }
)

// ************************************************************************* //
