constant/outerWall/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/outerWall/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outerBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1890;
    }
    solidInlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       1990;
    }
    solidOutlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       2000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       2010;
    }
    outerWall_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          100;
        startFace       4010;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_outerWall;
    }
)

// ************************************************************************* //
