constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    coolantInlet
    {
        type            patch;
        nFaces          30;
        startFace       10845;
    }
    coolantOutlet
    {
        type            patch;
        nFaces          30;
        startFace       10875;
    }
    hotGasWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       10905;
    }
    outerBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       11005;
    }
    solidInlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       11105;
    }
    solidOutlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       11130;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11000;
        startFace       11155;
    }
)

// ************************************************************************* //
