constant/fluid/turbulenceProperties
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;

