constant/outerWall/thermophysicalProperties
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   63.5;       // Copper
    }
    equationOfState
    {
        rho         8960;       // kg/m3 copper
    }
    thermodynamics
    {
        Cp          385;        // J/kg.K copper
        Hf          0;
    }
    transport
    {
        kappa       380;        // W/m.K copper — high conductivity
    }
}
