0/fluid/U
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);   // 10 m/s inlet velocity

boundaryField
{
    coolantInlet
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }

    coolantOutlet
    {
        type            zeroGradient;
    }

    fluid_to_innerWall
    {
        type            noSlip;
    }

    fluid_to_outerWall
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
