0/fluid/p_rgh
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;     // 1 atm

boundaryField
{
    coolantInlet
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    coolantOutlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    fluid_to_innerWall
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    fluid_to_outerWall
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    frontAndBack
    {
        type            empty;
    }
}

