0/innerWall/p
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    hotGasWall
    {
        type            calculated;
        value           uniform 100000;
    }

    innerWall_to_fluid
    {
        type            calculated;
        value           uniform 100000;
    }

    solidInlet
    {
        type            calculated;
        value           uniform 100000;
    }

    solidOutlet
    {
        type            calculated;
        value           uniform 100000;
    }

    frontAndBack
    {
        type            empty;
    }
}

