0/outerWall/T
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    outerBoundary
    {
        type            zeroGradient;   // insulated outer wall
    }

    outerWall_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     solidThermo;
        value           uniform 300;
    }

    solidInlet
    {
        type            zeroGradient;
    }

    solidOutlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}
