system/outerWall/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default     none;
}

laplacianSchemes
{
    default                 none;
    laplacian(alpha,h)      Gauss linear corrected;
    laplacian(alphaEff,h)   Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
}
