system/sampleDict
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type sets;
libs (sampling);

interpolationScheme cellPoint;
setFormat       csv;

sets
{
    wallProfile
    {
        type    uniform;
        axis    y;
        start   (0.05  0.0    0.001);
        end     (0.05  0.0055 0.001);
        nPoints 100;
    }

    coolantCenterline
    {
        type    uniform;
        axis    x;
        start   (0.0   0.0025 0.001);
        end     (0.1   0.0025 0.001);
        nPoints 100;
    }
}

fields (T p U);
